app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
  <%= f.label :delegated_id %><br>
  <%= f.select :delegated_id, User.all.collect {|u| [ u.username, u.id ] }, { :include_blank => true, :selected => @task.delegated_id}, class: "form-control" %>

SELECT "projects".* FROM "projects"
---
  <%= f.label :project_id %><br>
  <%= f.select :project_id, Project.all.collect {|p| [ p.name, p.id ] }, { :include_blank => true, :selected => @task.project_id}, class: "form-control" %>