app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 21 Jan 2014 07:36:52 UTC +00:00], ["name", "hallo"], ["updated_at", Tue, 21 Jan 2014 07:36:52 UTC +00:00]]
---
	def create
		@project = Project.new(project_params)
		if !@project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 980190962  [["name", "MyString"], ["updated_at", Tue, 21 Jan 2014 07:42:35 UTC +00:00]]
---
	def update
		@project = Project.find(params[:id])
		if !@project.update(project_params)