app/controllers/tasks_controller.rb

  def index
   if params[:sorting]
  @done = Task.where(done: true).order(params[:sorting] => :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 't' ORDER BY "tasks"."created_at" DESC

  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "deadline", "delegated_id", "done", "duration", "name", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "delegated_id" = ?, "updated_at" = ? WHERE "tasks"."id" = 7  [["delegated_id", 2], ["updated_at", Sat, 01 Feb 2014 20:08:04 UTC +00:00]]